constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          560;
        startFace       92080;
    }
    right
    {
        type            patch;
        nFaces          560;
        startFace       92640;
    }
    down
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       93200;
    }
    up
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       93280;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       93360;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          92800;
        startFace       93520;
    }
)

// ************************************************************************* //
