constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
simulationType LES;
LES
{
    LESModel    Smagorinsky;
    turbulence  on;
    printCoeffs on;
    delta       cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff 1;
    }
    PrandtlCoeffs
    {
        delta cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff 1;
        }
        smoothCoeffs
        {
            delta cubeRootVol;
            cubeRootVolCoeffs
            {
                deltaCoeff 1;
            }
            maxDeltaRatio 1.1;
        }
        Cdelta 0.158;
    }
    vanDriestCoeffs
    {
        delta cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff 1;
        }
        smoothCoeffs
        {
            delta cubeRootVol;
            cubeRootVolCoeffs
            {
                deltaCoeff 1;
            }
            maxDeltaRatio 1.1;
        }
        Aplus  26;
        Cdelta 0.158;
    }
    smoothCoeffs
    {
        delta cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff 1;
        }
        maxDeltaRatio 1.1;
    }
}
