system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     pimpleFoam;
startFrom       startTime;
startTime       10;
stopAt          endTime;
endTime         20;//00;
deltaT          0.01;
adjustTimeStep  on;
maxCo           0.6;
writeControl    adjustableRunTime;
writeInterval   0.1;//0;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable on;

functions
{
    #includeFunc residuals(U,p);
}