system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
solvers{
    p{
        solver PCG;
        preconditioner DIC;
        tolerance 1e-06;
        relTol 0.01;
    }
    U{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
    k{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
    epsilon{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
    pFinal{
        $p;
        relTol 0;
    }
    UFinal{
        $U;
        relTol 0;
    }
    kFinal{
        $k;
        relTol 0;
    }
    epsilonFinal{
        $epsilon;
        relTol 0;
    }
}
PIMPLE{
    nNonOrthogonalCorrectors 0;
    nCorrectors 2;
    pRefCell 0;
    pRefValue 0;
}
relaxationFactors{
    fields{
        p 0.3;
    }
    equations{
        U 0.7;
        k 0.7;
        epsilon 0.7;
    }
}
